// ======== ++++++ ========
// Example 2 - Відображення часу (if...else)

// Напиши скрипт для відображення годин та хвилин у консолі
// браузера у вигляді рядка формату `"14 г. 26 хв."`. Якщо значення
// змінної `minutes` дорівнює `0`, то
// виводь рядок `"14 г."`, без хвилин.

// const hours = 18
// const minutes = 0;
// let res;

// Варіaнт з if .. else
// if (minutes) {
//     res = `${hours} г. ${minutes} хв.`;
// } else {
//     res =`${hours} г.`;
// }

// Варіант з тернарним
// let res = `${hours} г.${minutes ? ' ' + minutes + ' хв.' : ''}`

// console.log(res);

// ======== ++++++ ========
// Example 3 - Розгалуження

// Напиши скрипт, який виводить у консоль рядок `"Це позитивне число"`,
// якщо у prompt користувач ввів число більше нуля.  Якщо було введено
// нуль, виводь в консоль рядок `"Це нуль"`. Якщо передали
// від'ємне число, у консолі
// повинен бути рядок `"Це негативне число"`.

// const inputValue = prompt('Введіть число')
// if (Number(inputValue) > 0) {
//     console.log("Це позитивне число")
// } else if (+inputValue === 0) {
//     console.log("Це нуль")
// } else if (+inputValue <== 0) {
//     console.log("Це негативне число")
// }


// ======== ++++++ ========
// Example 10 - Дедлайн здачі проекту (switch)

//     - Якщо до дедлайну 0 днів - виведи рядок `"Сьогодні"`
//     - Якщо до дедлайну 1 день - виведи рядок `"Завтра"`
//     - Якщо до дедлайну 2 дні - виведи рядок `"Післязавтра"`
//     - Якщо до дедлайну 3+ днів - виведи рядок `"Дата у майбутньому"`

// const days = 0;
// switch (days) {
//     case 0:
//         console.log("Сьогодні");
//         break;
//     case 1:
//         console.log("Завтра");
//         break;
//     case 2:
//         console.log("Післязавтра");
//         break;
//     default:
//         console.log("Дата у майбутньому");
// }

// ======== ++++++ ========
// Example 11 - Цикл for

// Напиши цикл for, який виводить у консоль браузера числа за
// зростанням від `min` до `max`, але тільки якщо число кратне `5`.

// const max = 15;
// for (let min = 1; min <= max; min += 1) {
//     if (min === 0) continue;
//     if (min % 5 === 0) {
//         console.log(min);
//     }
// }

// b++ те саме b = b + 1 чи b += 1
